<?php
// Heading
$_['heading_title']              = 'Playful Sparkle - COD fee';
$_['heading_getting_started']    = 'Начало работы';
$_['heading_setup']              = 'Настройка COD fee';
$_['heading_faq']                = 'Часто задаваемые вопросы';
$_['heading_contact']            = 'Контактная поддержка';

// Text
$_['text_extension']             = 'Расширения';
$_['text_success']               = 'Успех: Вы изменили комиссию за наложенный платеж!';
$_['text_edit']                  = 'Редактировать комиссию за наложенный платеж';
$_['text_getting_started']       = '<p><strong>Обзор:</strong> Расширение Playful Sparkle - COD fee для OpenCart 3.x позволяет владельцам магазинов добавлять настраиваемый сбор за заказы, оплаченные с помощью метода наложенного платежа (COD). Эта функция помогает компенсировать расходы на обработку COD и предоставляет больший контроль над итоговой суммой заказа.</p><p><strong>Требования:</strong> OpenCart 3.x+, PHP 7.3 или выше.</p>';
$_['text_setup']                 = '<p>Для настройки введите желаемую сумму сбора (с учетом налога), выберите соответствующий налоговый класс и активируйте расширение. Сбор будет автоматически применяться и корректироваться в соответствии с налоговыми настройками вашего магазина, перерасчитывая чистую сумму сбора на основе указанной налоговой ставки. Например, если сбор установлен в 5 евро, а налоговая ставка составляет 20%, сумма сбора будет перерасчитана на 4,17 евро (чистая) при оформлении заказа.</p>';
$_['text_faq']                   = '<details><summary>Могу ли я применить различные сборы для других способов оплаты?</summary>Нет, это расширение применяется только к заказам, оплачиваемым с помощью метода наложенного платежа (COD).</details><details><summary>Будет ли сбор отображаться отдельно в итогах заказа?</summary>Да, сбор будет отображаться как отдельная строка в итогах заказа во время оформления, с налоговыми корректировками в соответствии с налоговыми настройками магазина.</details>';
$_['text_contact']               = '<p>Для получения дополнительной помощи, пожалуйста, свяжитесь с нашей службой поддержки:</p><ul><li><strong>Контакт:</strong> <a href="mailto:%s">%s</a></li><li><strong>Документация:</strong> <a href="%s" target="_blank" rel="noopener noreferrer">Документация пользователя</a></li></ul>';

// Tab
$_['tab_general']                = 'Общее';
$_['tab_help_and_support']       = 'Помощь и поддержка';

// Entry
$_['entry_fee']                  = 'Комиссия';
$_['entry_tax_class']            = 'Налоговый класс';
$_['entry_status']               = 'Статус';
$_['entry_sort_order']           = 'Порядок сортировки';

// Error
$_['error_total_ps_cod_fee_fee'] = 'Комиссия не может быть пустой, меньше или равной нулю';

// Error
$_['error_permission']           = 'Предупреждение: У вас нет прав для изменения комиссии за наложенный платеж!';
